Repository: netdcy/FlowVision
Catalog: FlowVision/Sources/SettingsViews/mul.lproj/AdvancedSettingsViewController.xcstrings
Source language: en
Languages: ar, de, es, fr, it, ja, ko, nl, pt_br, pt_pt, ru, sv, zh_hans, zh_hant

# 1V0-bu-KPz.title
source: Do Not Use FFmpeg
ar: عدم استخدام FFmpeg
de: FFmpeg nicht verwenden
es: No usar FFmpeg
fr: Ne pas utiliser FFmpeg
it: Non utilizzare FFmpeg
ja: FFmpegを使用しない
ko: FFmpeg 사용 안 함
nl: Gebruik FFmpeg Niet
pt_br: Não Usar FFmpeg
pt_pt: Não Usar FFmpeg
ru: Не использовать FFmpeg
sv: Använd inte FFmpeg
zh_hans: 不使用FFmpeg
zh_hant: 不要使用FFmpeg

# A97-Bz-qH3.title
source: For mechanical hard drives and network drives, it is recommended to set it to 1. For external SSDs, this value can be increased appropriately.
ar: بالنسبة لمحركات الأقراص الصلبة الميكانيكية ومحركات الشبكة، يُوصى بتعيينها إلى 1. بالنسبة لمحركات الأقراص الصلبة الخارجية SSDs، يمكن زيادة هذه القيمة بشكل مناسب.
de: Für mechanische Festplatten und Netzlaufwerke wird empfohlen, den Wert auf 1 zu setzen. Bei externen SSDs kann dieser Wert angemessen erhöht werden.
es: Para discos duros mecánicos y unidades de red, se recomienda configurarlo en 1. Para SSDs externos, este valor se puede aumentar apropiadamente.
fr: Pour les disques durs mécaniques et les lecteurs réseau, il est recommandé de le régler sur 1. Pour les SSD externes, cette valeur peut être augmentée de manière appropriée.
it: Per i dischi rigidi meccanici e le unità di rete, si consiglia di impostarlo su 1. Per gli SSD esterni, questo valore può essere aumentato adeguatamente.
ja: 機械式ハードドライブとネットワークドライブの場合、1に設定することをお勧めします。外部SSDの場合、この値を適切に増やすことができます。
ko: 기계식 하드 드라이브와 네트워크 드라이브의 경우 1로 설정하는 것이 권장됩니다 외부 SSD의 경우 이 값을 적절히 증가시킬 수 있습니다
nl: Voor mechanische harde schijven en netwerkschijven wordt aanbevolen deze op 1 in te stellen. Voor externe SSD's kan deze waarde passend verhoogd worden.
pt_br: Para discos rígidos mecânicos e unidades de rede, é recomendável defini-lo como 1. Para SSDs externos, esse valor pode ser aumentado adequadamente.
pt_pt: Para discos rígidos mecânicos e unidades de rede, é recomendável defini-lo para 1. Para SSDs externos, este valor pode ser aumentado adequadamente.
ru: Для механических жестких дисков и сетевых накопителей рекомендуется установить значение 1 Для внешних SSD это значение можно увеличить при необходимости
sv: För mekaniska hårddiskar och nätverksenheter rekommenderas det att ställa in den på 1. För externa SSD-enheter kan detta värde ökas lämpligt.
zh_hans: 对于机械硬盘和网络驱动器建议设置为1，对于外置SSD可适当增大。
zh_hant: 對於機械硬碟和網路磁碟機，建議設定為1。對於外接式固態硬碟，此數值可以適當增加。

# FwL-1J-M3z.title
source: This setting applies to internal SSD. It is recommended to set it between 4 and 8.
ar: ينطبق هذا الإعداد على SSD الداخلي. يُوصى بتعيينه بين 4 و 8.
de: Diese Einstellung gilt für die interne SSD. Es wird empfohlen, sie zwischen 4 und 8 festzulegen.
es: Esta configuración se aplica al SSD interno. Se recomienda configurarlo entre 4 y 8.
fr: Ce paramètre s'applique au SSD interne. Il est recommandé de le régler entre 4 et 8.
it: Questa impostazione si applica all'SSD interno. Si consiglia di impostarla tra 4 e 8.
ja: この設定は内部SSDに適用されます。4から8の間に設定することをお勧めします。
ko: 이 설정은 내부 SSD에 적용됩니다 설정 값은 4에서 8 사이로 권장됩니다
nl: Deze instelling geldt voor interne SSD. Het wordt aanbevolen om deze tussen 4 en 8 in te stellen.
pt_br: Esta configuração se aplica ao SSD interno. Recomenda-se ajustá-la entre 4 e 8.
pt_pt: Essa configuração aplica-se ao SSD interno. Recomenda-se defini-la entre 4 e 8.
ru: Этот параметр применяется к внутреннему SSD. Рекомендуется установить его в пределах от 4 до 8.
sv: Denna inställning gäller den interna SSD:n. Det rekommenderas att ställa in den mellan 4 och 8.
zh_hans: 此设置应用于内置SSD。建议设置为4~8。
zh_hant: 此設定僅適用於內部SSD。建議設置在4到8之間

# G15-Qe-p8C.title
source: Use FFmpeg for More Video Format Thumbnails
ar: استخدم FFmpeg لمزيد من مصغرات تنسيقات الفيديو
de: Verwenden Sie FFmpeg für mehr Videoformat-Thumbnails
es: Usar FFmpeg para Más Miniaturas de Formato de Video
fr: Utiliser FFmpeg pour plus de vignettes de formats vidéo
it: Usa FFmpeg per Più Anteprime di Formati Video
ja: FFmpegを使用してより多くのビデオ形式のサムネイルを作成
ko: FFmpeg 사용하여 더 많은 비디오 형식 썸네일 보기
nl: Gebruik FFmpeg voor Meer Videobestandsminiaturen
pt_br: Usar FFmpeg para Mais Miniaturas de Formato de Vídeo
pt_pt: Usar FFmpeg para Mais Miniaturas de Formatos de Vídeo
ru: Использовать FFmpeg для эскизов большего числа видеоформатов
sv: Använd FFmpeg för fler videoformatminiatyrer
zh_hans: 使用FFmpeg支持更多视频格式缩略图
zh_hant: 使用 FFmpeg 生成更多影片格式縮圖

# L44-0u-7JE.title
source: Folder Search Depth: (External Volumes)
ar: عمق البحث في المجلد: (الأقراص الخارجية)
de: Ordner-Suchtiefe: (Externe Volumes)
es: Profundidad de Búsqueda en Carpetas: (Unidades Externas)
fr: Profondeur de recherche des dossiers : (Volumes externes)
it: Profondità di ricerca cartella: (Volume esterni)
ja: フォルダー検索深度：(外部ボリューム)
ko: 폴더 검색 깊이: (외부 볼륨)
nl: Mapzoekdiepte: (Externe volumes)
pt_br: Profundidade da Pesquisa de Pasta: (Volumes Externos)
pt_pt: Profundidade da Pesquisa de Pastas: (Unidades Externas)
ru: Глубина поиска в папках: (внешние тома)
sv: Mappsökningsdjup: (Externa volymer)
zh_hans: 文件夹搜索深度： （外部卷）
zh_hant: 資料夾搜尋深度： （外部磁碟）

# Tb5-5a-q2X.title
source: The number of subfolder levels to search when generating folder thumbnails. If set to 0, folder thumbnails will not be generated, and the directory tree will not indicate whether subfolders exist by left-side arrow.
ar: عدد مستويات المجلدات الفرعية للبحث عند إنشاء صور مصغرة للمجلدات. إذا تم تعيينه إلى 0، لن يتم إنشاء صور مصغرة للمجلدات، ولن يشير شجرة الدليل إلى ما إذا كانت المجلدات الفرعية موجودة بالسهم الجانبي الأيسر.
de: Die Anzahl der Unterordner-Ebenen, die beim Erstellen von Ordner-Thumbnails durchsucht werden. Wenn auf 0 gesetzt, werden keine Ordner-Thumbnails erstellt, und der Verzeichnisbaum zeigt nicht durch einen Pfeil auf der linken Seite an, ob Unterordner existieren.
es: El número de niveles de subcarpetas a buscar al generar miniaturas de carpetas. Si se establece en 0, no se generarán miniaturas de carpetas y el árbol de directorios no indicará si existen subcarpetas mediante la flecha del lado izquierdo.
fr: Le nombre de niveaux de sous-dossiers à explorer lors de la génération des vignettes de dossier. S'il est réglé sur 0, les vignettes de dossier ne seront pas générées et l'arborescence ne indiquera pas si des sous-dossiers existent par une flèche à gauche.
it: Il numero di livelli di sottocartella da cercare durante la generazione delle anteprime delle cartelle. Se impostato su 0, le anteprime delle cartelle non verranno generate e l'albero delle directory non indicherà se esistono sottocartelle con la freccia sul lato sinistro.
ja: フォルダサムネイルを生成するときに検索するサブフォルダーのレベル数 0に設定するとフォルダサムネイルは生成されずディレクトリツリーは左側の矢印でサブフォルダーの存在を示しません
ko: 폴더 축소판을 생성할 때 검색할 하위 폴더 수준의 수입니다. 0으로 설정하면 폴더 축소판이 생성되지 않으며, 디렉터리 트리가 왼쪽 화살표를 통해 하위 폴더의 존재 여부를 표시하지 않습니다
nl: Het aantal niveaus van submappen om te doorzoeken bij het genereren van mapminiaturen. Als dit is ingesteld op 0, worden er geen mapminiaturen gegenereerd en geeft de directorystructuur niet aan of er submappen bestaan door een pijl aan de linkerkant.
pt_br: O número de níveis de subpastas a serem pesquisados ao gerar miniaturas de pastas. Se definido como 0, miniaturas de pasta não serão geradas e a árvore de diretórios não indicará se subpastas existem através de seta no lado esquerdo.
pt_pt: O número de níveis de subpasta a pesquisar ao gerar miniaturas de pastas. Se definido como 0, as miniaturas de pastas não serão geradas, e a árvore de diretórios não indicará se existem subpastas através da seta do lado esquerdo.
ru: Количество уровней подпапок для поиска при создании эскизов папок. Если установлено значение 0, эскизы папок не будут создаваться, а дерево каталогов не будет указывать, существуют ли подпапки, стрелкой слева.
sv: Antalet undermappsnivåer att söka igenom vid generering av mappminiatyrer. Om den ställs in på 0 kommer inga mappminiatyrer att genereras, och mappträdet kommer inte att visa om undermappar existerar genom vänstersidospil.
zh_hans: 生成文件夹缩略图时，搜索子文件夹的层数。设置为0时，不生成文件夹缩略图，且目录树中将不能通过左侧箭头区分是否有子文件夹。
zh_hant: 要搜尋的子資料夾層數以生成資料夾縮圖。若設定為0，不會生成資料夾縮圖，且目錄樹不會以左側箭頭指示是否存在子資料夾。

# UN1-r8-SEh.title
source: Folder Search Depth:
ar: عمق البحث في المجلد:
de: Suchttiefe für Ordner:
es: Profundidad de Búsqueda de Carpetas:
fr: Profondeur de recherche des dossiers :
it: Profondità di ricerca cartella:
ja: フォルダー検索の深さ:
ko: 폴더 검색 깊이:
nl: Mapvestigingszoekdiepte:
pt_br: Profundidade da Pesquisa na Pasta:
pt_pt: Profundidade de Pesquisa de Pasta:
ru: Глубина поиска в папке:
sv: Mappsökningsdjup:
zh_hans: 文件夹搜索深度：
zh_hant: 資料夾搜索深度：

# UWB-wJ-kV4.title
source: Thumbnail Threads:
ar: المصغرات:
de: Miniaturansichten:
es: Hilos de Miniaturas:
fr: Fils de vignettes :
it: Argomenti delle miniature:
ja: サムネイルスレッド：
ko: 썸네일 스레드:
nl: Miniatuur threads:
pt_br: Tópicos de Miniaturas:
pt_pt: Tópicos das Miniaturas:
ru: Эскизы потоков:
sv: Miniatyrtrådar:
zh_hans: 缩略图线程数：
zh_hant: 縮略圖執行緒

# VVf-Z7-kSI.title
source: e.g. 4G
ar: مثل 4G
de: z. B. 4G
es: p. ej. 4G
fr: par exemple, 4G
it: es. 4G
ja: 例：4G
ko: 예: 4G
nl: bijv. 4G
pt_br: por exemplo, 4G
pt_pt: por exemplo, 4G
ru: например, 4G
sv: t.ex. 4G
zh_hant: 例如 4G

# YPT-xM-oyn.title
source: These settings apply to external volumes, including external drives, network drives, and other mounted directories.
ar: تنطبق هذه الإعدادات على وحدات التخزين الخارجية، بما في ذلك محركات الأقراص الخارجية ومحركات الشبكة والمجلدات المثبتة الأخرى.
de: Diese Einstellungen gelten für externe Volumes, einschließlich externer Laufwerke, Netzwerklaufwerke und anderer eingebundener Verzeichnisse.
es: Estas configuraciones se aplican a volúmenes externos, incluidas unidades externas, unidades de red y otros directorios montados.
fr: Ces paramètres s'appliquent aux volumes externes, y compris les lecteurs externes, les lecteurs réseau et autres répertoires montés.
it: Queste impostazioni si applicano ai volumi esterni, inclusi dischi esterni, unità di rete e altre directory montate
ja: これらの設定は、外部ドライブ、ネットワークドライブ、その他のマウントされたディレクトリを含む外部ボリュームに適用されます
ko: 이 설정은 외장 드라이브, 네트워크 드라이브 및 기타 마운트된 디렉토리를 포함한 외부 볼륨에 적용됩니다
nl: Deze instellingen zijn van toepassing op externe volumes, waaronder externe schijven, netwerkschijven en andere gekoppelde mappen.
pt_br: Essas configurações se aplicam a volumes externos, incluindo unidades externas, unidades de rede e outros diretórios montados.
pt_pt: Estas definições aplicam-se a volumes externos, incluindo drives externas, drives de rede e outros diretórios montados.
ru: Эти настройки применяются к внешним томам, включая внешние накопители, сетевые диски и другие монтированные каталоги.
sv: Dessa inställningar gäller externa volymer, inklusive externa enheter, nätverksenheter och andra monterade kataloger.
zh_hans: 此处设置应用于外部卷，包括外置驱动器、网络驱动器和其它挂载目录。
zh_hant: 這些設定適用於外部卷，包括外接硬碟、網路磁碟機和其他掛載的目錄

# a8Q-Mw-3Xn.title
source: Memory Usage Limit:
ar: حد استخدام الذاكرة:
de: Speichernutzungslimit:
es: Límite de uso de memoria:
fr: Limite d'utilisation de la mémoire :
it: Limite utilizzo memoria:
ja: メモリ使用量の制限:
ko: 메모리 사용 제한:
nl: Limiet gebruik geheugen:
pt_br: Limite de Uso de Memória:
pt_pt: Limite de Uso de Memória:
ru: Лимит использования памяти:
sv: Begränsning av minnesanvändning:
zh_hans: 内存使用限制：
zh_hant: 記憶體使用上限：

# bnu-AS-zpg.title
source: Load Dynamic Library:
ar: تحميل المكتبة الديناميكية:
de: Dynamische Bibliothek laden:
es: Cargar biblioteca dinámica:
fr: Charger la bibliothèque dynamique :
it: Carica Libreria Dinamica:
ja: 動的ライブラリをロード:
ko: 동적 라이브러리 로드:
nl: Dynamische bibliotheek laden:
pt_br: Carregar Biblioteca Dinâmica:
pt_pt: Carregar Biblioteca Dinâmica:
ru: Загрузить динамическую библиотеку:
sv: Ladda dynamiskt bibliotek:
zh_hans: 加载动态库：
zh_hant: 載入動態庫:

# fpm-qG-HXc.title
source: Thumbnail Threads: （External Volumes）
ar: مصغرات المواضيع: (الأقراص الخارجية)
de: Miniaturansichten Threads:\n（Externe Volumes）
es: Hilos en miniatura: （Volúmenes externos）
fr: Threads de miniatures :\n（Volumes externes）
it: Thread delle miniature: （Volumi esterni）
ja: サムネイルスレッド：\n（外部ボリューム）
ko: 미리보기 스레드: (외부 볼륨)
nl: Miniatuur Draadtaken: （Externe Volumes）
pt_br: Miniaturas de Threads: （Volumes Externos）
pt_pt: Tópicos de Miniaturas: （Volumes Externos）
ru: Эскизы потоков: （Внешние тома）
sv: Miniatyrtrådar: （Externa volymer）
zh_hans: 缩略图线程数： （外部卷）
zh_hant: 縮略圖執行緒： （外部卷）

# lIW-EQ-tyL.title
source: When the application's memory usage exceeds the limit, the thumbnail rendering cache in each directory will be cleared sequentially based on the last accessed time.
ar: عندما يتجاوز استخدام ذاكرة التطبيق الحد المسموح به، ستتم مسح ذاكرة التخزين المؤقت للتصوير المصغر في كل دليل تسلسليًا بناءً على آخر وقت تم الوصول فيه إليها.
de: Wenn die Speichernutzung der Anwendung das Limit überschreitet, wird der Thumbnail-Rendering-Cache in jedem Verzeichnis basierend auf der letzten Zugriffszeit nacheinander geleert.
es: Cuando el uso de memoria de la aplicación excede el límite, la caché de renderizado de miniaturas en cada directorio se borrará secuencialmente según el tiempo de último acceso
fr: Lorsque l'utilisation de la mémoire de l'application dépasse la limite, le cache de rendu des vignettes dans chaque répertoire sera effacé séquentiellement en fonction du dernier temps d'accès
it: Quando l'uso della memoria dell'applicazione supera il limite, la cache di rendering delle miniature in ciascuna directory sarà cancellata in sequenza in base all'ultima volta di accesso
ja: アプリケーションのメモリ使用量が制限を超えた場合、各ディレクトリのサムネイルレンダリングキャッシュは最後にアクセスされた時間に基づいて順次クリアされます
ko: 애플리케이션의 메모리 사용량이 제한을 초과하면 각 디렉터리의 썸네일 렌더링 캐시는 마지막으로 접근한 시간을 기준으로 순차적으로 삭제됩니다.
nl: Wanneer het geheugenverbruik van de applicatie de limiet overschrijdt, wordt de cache voor het renderen van miniaturen in elke map opeenvolgend gewist op basis van de laatst toegangsdatum.
pt_br: Quando o uso de memória do aplicativo exceder o limite, o cache de renderização de miniaturas em cada diretório será limpo sequencialmente com base no horário de último acesso.
pt_pt: Quando a utilização de memória da aplicação exceder o limite, a cache de renderização de miniaturas em cada diretório será limpa sequencialmente com base no tempo de último acesso.
ru: Когда использование памяти приложением превышает ограничение, кэш миниатюр в каждом каталоге будет поочередно очищаться на основе времени последнего доступа.
sv: När applikationens minnesanvändning överskrider gränsen kommer miniatyrrenderingscachen i varje katalog att rensas sekventiellt baserat på senaste åtkomsttid.
zh_hans: 当程序内存使用量超过限制后，将按最后浏览时间依次清理各目录的缩略图渲染缓存。
zh_hant: 當應用程式的記憶體使用量超過限制時，將根據最後存取時間依序清除每個目錄的縮圖渲染快取。

# o1C-Ac-oMz.title
source: The application has built-in FFmpeg library. If exception occurs while generating video thumbnails, please try to disable this option or uncheck "Show Video Files".
ar: يحتوي التطبيق على مكتبة FFmpeg مدمجة. إذا حدث استثناء أثناء إنشاء صور مصغرة للفيديو، يرجى محاولة تعطيل هذا الخيار أو إلغاء تحديد "إظهار ملفات الفيديو".
de: Die Anwendung hat eine integrierte FFmpeg-Bibliothek. Wenn beim Erstellen von Videothumbnails eine Ausnahme auftritt, versuchen Sie bitte, diese Option zu deaktivieren oder "Videodateien anzeigen" abzuwählen.
es: La aplicación tiene una biblioteca de FFmpeg integrada. Si se produce una excepción al generar miniaturas de video, intente desactivar esta opción o desmarcar "Mostrar archivos de video".
fr: L'application intègre une bibliothèque FFmpeg. Si une exception se produit lors de la génération de vignettes vidéo, essayez de désactiver cette option ou de décocher "Afficher les fichiers vidéo"
it: L'applicazione ha una libreria FFmpeg incorporata. Se si verifica un'eccezione durante la generazione delle anteprime video, prova a disabilitare questa opzione o deseleziona "Mostra file video".
ja: アプリケーションにはFFmpegライブラリが組み込まれています ビデオサムネイルを生成中に例外が発生した場合は、このオプションを無効にするか「ビデオファイルを表示」をオフにしてみてください
ko: 응용 프로그램에는 내장된 FFmpeg 라이브러리가 있습니다. 비디오 썸네일 생성 중 예외가 발생하면 이 옵션을 비활성화하거나 "비디오 파일 표시" 옵션을 해제해 보세요.
nl: De applicatie heeft een ingebouwde FFmpeg-bibliotheek. Als er een uitzondering optreedt tijdens het genereren van videominiaturen, probeer dan deze optie uit te schakelen of "Videobestanden weergeven" uit te vinken.
pt_br: O aplicativo possui a biblioteca FFmpeg embutida. Se ocorrer uma exceção ao gerar miniaturas de vídeo, tente desabilitar esta opção ou desmarcar "Mostrar arquivos de vídeo".
pt_pt: A aplicação tem a biblioteca FFmpeg incorporada Se ocorrer uma exceção ao gerar miniaturas de vídeo, por favor, tente desativar esta opção ou desmarcar "Mostrar Ficheiros de Vídeo"
ru: Программа имеет встроенную библиотеку FFmpeg. Если возникает исключение при создании эскизов видео, попробуйте отключить эту опцию или снять флажок "Показывать видеофайлы"
sv: Applikationen har ett inbyggt FFmpeg-bibliotek. Om undantag uppstår när videominiatyrer genereras, prova att inaktivera detta alternativ eller avmarkera "Visa videofiler".
zh_hans: 应用已内置FFmpeg库。如果在生成视频缩略图时产生异常，请尝试关闭此选项，或者取消勾选“显示视频文件”。
zh_hant: 應用程式內建了FFmpeg庫。如果在生成視頻縮略圖時發生異常，請嘗試停用此選項或取消選中「顯示視頻文件」

# v0X-zl-sTc.title
source: For network drives, it is recommended to set it to 0 (do not generate folder thumbnails).
ar: بالنسبة لمحركات الأقراص الشبكية، يُوصى بتعيينها إلى 0 (لا تقم بإنشاء صور مصغرة للمجلدات)
de: Für Netzlaufwerke wird empfohlen, den Wert auf 0 zu setzen (keine Ordner-Miniaturansichten generieren).
es: Para las unidades de red, se recomienda configurarlo en 0 (no generar miniaturas de carpetas)
fr: Pour les lecteurs réseau, il est recommandé de le régler sur 0 (ne pas générer de miniatures de dossiers)
it: Per le unità di rete, si consiglia di impostarlo a 0 (non generare miniature delle cartelle)
ja: ネットワークドライブの場合は、0に設定することをお勧めします（フォルダーのサムネイルを生成しない）。
ko: 네트워크 드라이브의 경우 0으로 설정하는 것이 권장됩니다 (폴더 썸네일을 생성하지 않음).
nl: Voor netwerkschijven wordt aanbevolen deze in te stellen op 0 (geen mappenminiatuurweergaven genereren)
pt_br: Para unidades de rede, é recomendado definir como 0 (não gerar miniaturas de pastas)
pt_pt: Para unidades de rede, é recomendado definir para 0 (não gerar miniaturas de pastas)
ru: Для сетевых дисков рекомендуется установить значение 0 (не создавать эскизы папок)
sv: För nätverksenheter rekommenderas det att sätta den till 0 (generera inte mappminiatyrer)
zh_hans: 对于网络驱动器建议设置为0(不生成文件夹缩略图)。
zh_hant: 對於網絡磁碟機，建議將其設置為0（不生成資料夾縮圖）
